[
  [
    {
      "name": "Что следует сделать перед знаком \"Yield\"?",
      "image": "https://russiantestdmv.com/wp-content/uploads/2021/03/dorojnie-znaki-ssha-096-650x200.jpg",
      "buttons": [
        {
          "text": "1) Сбавить скорость и приготовиться остановиться, если потребуется",
          "seccess": true
        },
        {
          "text": "2) Уступить автомобилям экстренных служб",
          "seccess": false
        },
        {
          "text": "3) Полностью остановиться",
          "seccess": false
        },
        {
          "text": "4) Продолжать движение, следя за обстановкой по обеим сторонам",
          "seccess": false
        }
      ]
    },
    {
      "name": "Какая из указанных форм относится к знакам, регулирующим скорость?",
      "image": "https://russiantestdmv.com/wp-content/uploads/2020/08/Formy-dorozhnyh-znakov-SShA-650x200.jpg",
      "buttons": [
        {
          "text": "1) № 1",
          "seccess": false
        },
        {
          "text": "2) № 2",
          "seccess": false
        },
        {
          "text": "3) № 3",
          "seccess": false
        },
        {
          "text": "4) № 4",
          "seccess": true
        },
        {
          "text": "5) № 5",
          "seccess": false
        }
      ]
    },
    {
      "name": "Какие цвета у навигационных знаков?",
      "buttons": [
        {
          "text": "1) Желтый фон с черными символами и буквами",
          "seccess": false
        },
        {
          "text": "2) Зеленый фон с белыми символами и буквами",
          "seccess": true
        },
        {
          "text": "3) Белый фон с черными символами и буквами",
          "seccess": false
        },
        {
          "text": "4) Белый фон с красными символами и буквами",
          "seccess": false
        }
      ]
    },
    {
      "name": "Если школьный автобус остановился на двухполосном шоссе для высадки пассажиров, включив красные сигнальные огни, то:",
      "buttons": [
        {
          "text": "1) Можно объехать автобус по обочине",
          "seccess": false
        },
        {
          "text": "2) Можно объехать автобус, в каком бы направлении вы ни двигались, при отсутствии детей",
          "seccess": false
        },
        {
          "text": "3) Транспорт, движущийся в любом направлении, должен остановиться",
          "seccess": true
        },
        {
          "text": "4) Можно объехать автобус по встречной полосе при отсутствии встречного транспорта",
          "seccess": false
        }
      ]
    },
    {
      "name": "Что из перечисленного могут использовать велосипедисты?",
      "buttons": [
        {
          "text": "1) Велодорожку",
          "seccess": false
        },
        {
          "text": "2) Обочину",
          "seccess": false
        },
        {
          "text": "3) Проезжую часть",
          "seccess": false
        },
        {
          "text": "4) Все эти варианты",
          "seccess": true
        }
      ]
    },
    {
      "name": "Желтые знаки в форме ромба указывают на:",
      "buttons": [
        {
          "text": "1) Необходимость остановиться",
          "seccess": false
        },
        {
          "text": "2) Расстояния до населенных пунктов",
          "seccess": false
        },
        {
          "text": "3) Возможные опасности на дороге",
          "seccess": true
        },
        {
          "text": "4) Ограничение скорости",
          "seccess": false
        }
      ]
    },
    {
      "name": "Что из перечисленного является правилом безопасного вождения?",
      "buttons": [
        {
          "text": "1) Всегда смотрите прямо на дорогу перед собой",
          "seccess": false
        },
        {
          "text": "2) Осматривайтесь по сторонам, чтобы быть в курсе дорожной ситуации",
          "seccess": true
        },
        {
          "text": "3) Уверенность в своих силах поможет избежать любых опасностей",
          "seccess": false
        },
        {
          "text": "4) Другие водители должны подстраиваться под ваши оплошности",
          "seccess": false
        }
      ]
    },
    {
      "name": "Для предотвращения заносов на скользкой дороге нужно:",
      "buttons": [
        {
          "text": "1) Замедляться перед входом в поворот",
          "seccess": false
        },
        {
          "text": "2) Тормозить заранее и с осторожностью",
          "seccess": false
        },
        {
          "text": "3) Уменьшить давление на педаль тормоза, если колеса начнут блокироваться",
          "seccess": false
        },
        {
          "text": "4) Все перечисленное",
          "seccess": true
        }
      ]
    },
    {
      "name": "Мигающий красный сигнал светофора означает:",
      "buttons": [
        {
          "text": "1) То же, что и знак \"Въезд запрещен\" (Do Not Enter)",
          "seccess": false
        },
        {
          "text": "2) То же, что и знак \"Yield\"",
          "seccess": false
        },
        {
          "text": "3) То же, что и знак \"STOP\"",
          "seccess": true
        },
        {
          "text": "4) То же, что и знак \"Wrong Way\"",
          "seccess": false
        }
      ]
    },
    {
      "name": "В каком из перечисленных вариантов не нужно останавливаться?",
      "buttons": [
        {
          "text": "1) На мигающий красный сигнал светофора",
          "seccess": false
        },
        {
          "text": "2) На мигающий желтый сигнал светофора",
          "seccess": true
        },
        {
          "text": "3) У знака \"STOP\"",
          "seccess": false
        },
        {
          "text": "4) На красный сигнал светофора",
          "seccess": false
        }
      ]
    },
    {
      "name": "Поворачивая направо, нужно:",
      "buttons": [
        {
          "text": "1) Начать перестраиваться после пересечения центра перекрестка",
          "seccess": false
        },
        {
          "text": "2) Начинать маневр из правой полосы",
          "seccess": true
        },
        {
          "text": "3) Начинать маневр из левой полосы",
          "seccess": false
        },
        {
          "text": "4) Начинать маневр с центральной полосы движения",
          "seccess": false
        }
      ]
    },
    {
      "name": "При движении во время тумана или при плохой видимости, вы должны использовать:",
      "buttons": [
        {
          "text": "1) Только габаритные огни",
          "seccess": false
        },
        {
          "text": "2) Фары ближнего света",
          "seccess": true
        },
        {
          "text": "3) Фары дальнего света",
          "seccess": false
        },
        {
          "text": "4) Аварийные сигналы",
          "seccess": false
        }
      ]
    },
    {
      "name": "Паркуясь рядом с бордюром на дороге, идущей в горку, нужно:",
      "image": "https://russiantestdmv.com/wp-content/uploads/2021/03/Parkovka-na-podeme-650x200.jpg",
      "buttons": [
        {
          "text": "1) Повернуть передние колеса в сторону бордюра",
          "seccess": false
        },
        {
          "text": "2) Установить колеса параллельно бордюру",
          "seccess": false
        },
        {
          "text": "3) Повернуть колеса в любую сторону",
          "seccess": false
        },
        {
          "text": "4) Повернуть передние колеса в сторону проезжей части",
          "seccess": true
        }
      ]
    },
    {
      "name": "Этот знак означает:",
      "image": "https://russiantestdmv.com/wp-content/uploads/2021/03/dorojnie-znaki-ssha-038-650x200.jpg",
      "buttons": [
        {
          "text": "1) Переход запрещен",
          "seccess": false
        },
        {
          "text": "2) Впереди школьная зона",
          "seccess": false
        },
        {
          "text": "3) Впереди пешеходный переход",
          "seccess": true
        },
        {
          "text": "4) Рабочие на проезжей части",
          "seccess": false
        }
      ]
    },
    {
      "name": "Вы собираетесь повернуть направо на перекрестке, когда на светофоре горит красный свет. Вы должны:",
      "buttons": [
        {
          "text": "1) Включить поворотник и ждать зеленого сигнала",
          "seccess": false
        },
        {
          "text": "2) Сбавить скорость и осмотреться по сторонам",
          "seccess": false
        },
        {
          "text": "3) Остановиться, включить поворотник и повернуть, если это безопасно и отсутствуют запрещающие знаки",
          "seccess": true
        },
        {
          "text": "4) Дождаться зеленой стрелки",
          "seccess": false
        }
      ]
    },
    {
      "name": "Белые знаки в форме вертикального прямоугольника означают:",
      "image": "https://russiantestdmv.com/wp-content/uploads/2020/08/Belye-pryamougolnye-vertikalnye-znaki-650x200.jpg",
      "buttons": [
        {
          "text": "1) Что впереди школьная зона",
          "seccess": false
        },
        {
          "text": "2) Вы должны следовать правилам, указанным на знаке",
          "seccess": true
        },
        {
          "text": "3) Расположение и расстояние до населенных пунктов",
          "seccess": false
        },
        {
          "text": "4) Потенциальные опасности на дороге",
          "seccess": false
        }
      ]
    },
    {
      "name": "Если светофор не работает, водители должны:",
      "buttons": [
        {
          "text": "1) Двигаться так, как будто для всех направлений горит жетый сигнал",
          "seccess": false
        },
        {
          "text": "2) Двигаться так, как будто для всех направлений горит зеленый сигнал",
          "seccess": false
        },
        {
          "text": "3) Остановиться, если это возможно",
          "seccess": false
        },
        {
          "text": "4) Двигаться так, как будто для всех направлений установлен знак \"STOP\"",
          "seccess": true
        }
      ]
    },
    {
      "name": "Белую сплошную линию на шоссе можно пересекать:",
      "buttons": [
        {
          "text": "1) Для обгона",
          "seccess": false
        },
        {
          "text": "2) Для предотвращения аварийной ситуации",
          "seccess": true
        },
        {
          "text": "3) Для смены полосы на перекрестке",
          "seccess": false
        },
        {
          "text": "4) Все варианты верны",
          "seccess": false
        }
      ]
    },
    {
      "name": "Какое из утверждений о круговом перекрестке является неверным?",
      "buttons": [
        {
          "text": "1) Включите правый поворотник, чтобы обозначить свое намерение выехать",
          "seccess": false
        },
        {
          "text": "2) Заезжайте на кольцевой перекресток с левой стороны и двигайтесь по часовой стрелке",
          "seccess": true
        },
        {
          "text": "3) Уступите дорогу автомобилям и велосипедистам, едущим по кругу",
          "seccess": false
        },
        {
          "text": "4) Не пытайтесь обогнать велосипедистов на круговой развязке",
          "seccess": false
        }
      ]
    },
    {
      "name": "Водители, приближаясь к велосипедисту в ночное время, НЕ должны:",
      "buttons": [
        {
          "text": "1) Использовать фары ближнего света",
          "seccess": false
        },
        {
          "text": "2) Держаться от него на дистанции не менее 3 футов",
          "seccess": false
        },
        {
          "text": "3) Подавать звуковой сигнал",
          "seccess": true
        },
        {
          "text": "4) Соблюдать осторожность",
          "seccess": false
        }
      ]
    },
    {
      "name": "Что означает этот знак?",
      "image": "https://russiantestdmv.com/wp-content/uploads/2021/03/dorojnie-znaki-ssha-070-650x200.jpg",
      "buttons": [
        {
          "text": "1) Впереди круговое движение",
          "seccess": false
        },
        {
          "text": "2) Впереди разделитель. Держитесь правее",
          "seccess": true
        },
        {
          "text": "3) Впереди разделенное движение заканчивается",
          "seccess": false
        },
        {
          "text": "4) Ваша полоса сужается. Держитесь левее.",
          "seccess": false
        }
      ]
    },
    {
      "name": "Два автомобиля приближаются к нерегулируемому Т-образному перекрестку. Кто из них имеет преимущество проезда?",
      "image": "https://russiantestdmv.com/wp-content/uploads/2020/08/Pravo-proezda-na-T-obraznom-perekrestke-650x200.jpg",
      "buttons": [
        {
          "text": "1) Автомобиль справа (1) всегда имеет преимущество проезда",
          "seccess": false
        },
        {
          "text": "2) Автомобиль, движущийся по сквозной дороге (2)",
          "seccess": true
        },
        {
          "text": "3) Автомобиль, который первым подъедет к перекрестку",
          "seccess": false
        },
        {
          "text": "4) Автомобиль, перевозящий более двух пассажиров",
          "seccess": false
        }
      ]
    },
    {
      "name": "Какое из утверждений верное?",
      "buttons": [
        {
          "text": "1) Все грузовики имеют пневматические тормоза, помогающие им быстрее остановиться",
          "seccess": false
        },
        {
          "text": "2) Грузовики более маневренные, чем легковые автомобили",
          "seccess": false
        },
        {
          "text": "3) У грузовиков тормозной путь больше, чем у легковых автомобилей",
          "seccess": true
        },
        {
          "text": "4) У грузовиков слепые зоны меньше, чем у легковых автомобилей",
          "seccess": false
        }
      ]
    },
    {
      "name": "Этот знак означает:",
      "image": "https://russiantestdmv.com/wp-content/uploads/2021/03/dorojnie-znaki-ssha-053-650x200.jpg",
      "buttons": [
        {
          "text": "1) Водителям запрещено поворачивать направо, если они едут со скоростью 25 миль/ч и меньше",
          "seccess": false
        },
        {
          "text": "2) За поворотом школьная зона",
          "seccess": false
        },
        {
          "text": "3) Не снижайте скорость на повороте ниже 25 миль/ч",
          "seccess": false
        },
        {
          "text": "4) Рекомендуемая скорость для входа в поворот не более 25 миль/ч",
          "seccess": true
        }
      ]
    },
    {
      "name": "Какую из указанных форм имеет знак STOP?",
      "image": "https://russiantestdmv.com/wp-content/uploads/2020/08/Formy-dorozhnyh-znakov-SShA-1-650x200.jpg",
      "buttons": [
        {
          "text": "1) № 1",
          "seccess": false
        },
        {
          "text": "2) № 2",
          "seccess": false
        },
        {
          "text": "3) № 3",
          "seccess": true
        },
        {
          "text": "4) № 4",
          "seccess": false
        }
      ]
    },
    {
      "name": "Автомобили, въезжающие на скоростную трассу:",
      "buttons": [
        {
          "text": "1) Имеют преимущество проезда перед грузовиками",
          "seccess": false
        },
        {
          "text": "2) Должны уступить транспорту, движущемуся по шоссе",
          "seccess": true
        },
        {
          "text": "3) Имеют право проезда",
          "seccess": false
        },
        {
          "text": "4) Должны сразу перестроиться в левую полосу",
          "seccess": false
        }
      ]
    },
    {
      "name": "Что должен сделать водитель, увидев знак \"Wrong Way\"?",
      "image": "https://russiantestdmv.com/wp-content/uploads/2021/03/dorojnie-znaki-ssha-095-650x200.jpg",
      "buttons": [
        {
          "text": "1) Немедленно развернуться",
          "seccess": true
        },
        {
          "text": "2) Двигаться дальше с осторожностью",
          "seccess": false
        },
        {
          "text": "3) То же, что перед знаком \"СТОП\"",
          "seccess": false
        },
        {
          "text": "4) Остановиться и вызвать полицию",
          "seccess": false
        }
      ]
    },
    {
      "name": "Что имеет большее преимущество?",
      "buttons": [
        {
          "text": "1) Знак \"STOP\"",
          "seccess": false
        },
        {
          "text": "2) Непрерывно горящий красный сигнал светофора",
          "seccess": false
        },
        {
          "text": "3) Мигающий красный сигнал",
          "seccess": false
        },
        {
          "text": "4) Указания регулировщика",
          "seccess": true
        }
      ]
    }
  ]
]