[
  {
    "asd": [
      {
        "name": "Что из перечисленного могут использовать велосипедисты?",
        "buttons": [
          {
            "text": "1) Велодорожку",
            "seccess": false
          },
          {
            "text": "2) Обочину",
            "seccess": false
          },
          {
            "text": "3) Проезжую часть",
            "seccess": false
          },
          {
            "text": "4) Все эти варианты",
            "seccess": true
          }
        ]
      },
      {
        "name": "В чем заключается основное отличие при вождении по скоростному (highway) и обычному шоссе?",
        "buttons": [
          {
            "text": "1) На скоростном шоссе разрешенная скорость движения выше",
            "seccess": true
          },
          {
            "text": "2) Грузовикам запрещено выезжать на скоростные шоссе",
            "seccess": false
          },
          {
            "text": "3) Мотоциклисты на скоростном шоссе должны двигаться по правой полосе",
            "seccess": false
          },
          {
            "text": "4) На скоростном шоссе более плотный поток",
            "seccess": false
          }
        ]
      },
      {
        "name": "Мигающий красный сигнал светофора означает:",
        "buttons": [
          {
            "text": "1) То же, что и знак \"Въезд запрещен\" (Do Not Enter)",
            "seccess": false
          },
          {
            "text": "2) То же, что и знак \"Yield\"",
            "seccess": false
          },
          {
            "text": "3) То же, что и знак \"STOP\"",
            "seccess": true
          },
          {
            "text": "4) То же, что и знак \"Wrong Way\"",
            "seccess": false
          }
        ]
      },
      {
        "name": "Знак \"No Stopping Any Time\" обозначает:",
        "image": "https://russiantestdmv.com/wp-content/uploads/2021/03/dorojnie-znaki-ssha-125-650x200.jpg",
        "buttons": [
          {
            "text": "1) Остановка разрешена для посадки и высадки пассажиров",
            "seccess": false
          },
          {
            "text": "2) Остановка разрешена только по требованию сотрудника полиции",
            "seccess": true
          },
          {
            "text": "3) Остановка запрещена при любых условиях",
            "seccess": false
          },
          {
            "text": "4) Остановка разрешена только для разгрузки и погрузки",
            "seccess": false
          }
        ]
      },
      {
        "name": "Желтые знаки в форме ромба указывают на:",
        "buttons": [
          {
            "text": "1) Необходимость остановиться",
            "seccess": false
          },
          {
            "text": "2) Расстояния до населенных пунктов",
            "seccess": false
          },
          {
            "text": "3) Возможные опасности на дороге",
            "seccess": true
          },
          {
            "text": "4) Ограничение скорости",
            "seccess": false
          }
        ]
      },
      {
        "name": "Водители, приближаясь к велосипедисту в ночное время, НЕ должны:",
        "buttons": [
          {
            "text": "1) Использовать фары ближнего света",
            "seccess": false
          },
          {
            "text": "2) Держаться от него на дистанции не менее 3 футов",
            "seccess": false
          },
          {
            "text": "3) Подавать звуковой сигнал",
            "seccess": true
          },
          {
            "text": "4) Соблюдать осторожность",
            "seccess": false
          }
        ]
      },
      {
        "name": "Всегда запрещено парковаться:",
        "buttons": [
          {
            "text": "1) На улице с односторонним движением",
            "seccess": false
          },
          {
            "text": "2) У входа в здание",
            "seccess": false
          },
          {
            "text": "3) На пешеходном переходе",
            "seccess": true
          },
          {
            "text": "4) Ближе 50 футов от пожарного гидранта",
            "seccess": false
          }
        ]
      },
      {
        "name": "Если школьный автобус остановился на обочине, не включая красных огней, вы должны:",
        "buttons": [
          {
            "text": "1) Остановиться, пока автобус не поедет дальше",
            "seccess": false
          },
          {
            "text": "2) Остановиться, только если находитесь на той же стороне, что и автобус",
            "seccess": false
          },
          {
            "text": "3) Осторожно проехать мимо автобуса, не останавливаясь",
            "seccess": true
          },
          {
            "text": "4) Остановиться, пока водитель автобуса не даст вам сигнал продолжить движение",
            "seccess": false
          }
        ]
      },
      {
        "name": "В каком из перечисленных вариантов не нужно останавливаться?",
        "buttons": [
          {
            "text": "1) На мигающий красный сигнал светофора",
            "seccess": false
          },
          {
            "text": "2) На мигающий желтый сигнал светофора",
            "seccess": true
          },
          {
            "text": "3) У знака \"STOP\"",
            "seccess": false
          },
          {
            "text": "4) На красный сигнал светофора",
            "seccess": false
          }
        ]
      },
      {
        "name": "Приближаясь к перекрестку со знаком \"STOP\", нужно:",
        "buttons": [
          {
            "text": "1) Снизить скорость и двигаться с осторожностью",
            "seccess": false
          },
          {
            "text": "2) Остановиться только в случае, когда другая машина пересекает перекресток",
            "seccess": false
          },
          {
            "text": "3) Полностью остановиться и продолжить движение при отсутствии помех",
            "seccess": true
          },
          {
            "text": "4) Уступить право проезда всему транспорту на перекрестке",
            "seccess": false
          }
        ]
      },
      {
        "name": "Как выглядит знак дорожных работ?",
        "buttons": [
          {
            "text": "1) Белый прямоугольник с черными символами",
            "seccess": false
          },
          {
            "text": "2) Оранжевый ромб с черными символами",
            "seccess": true
          },
          {
            "text": "3) Зеленый прямоугольник с белыми символами",
            "seccess": false
          },
          {
            "text": "4) Желтый круг с черными символами",
            "seccess": false
          }
        ]
      },
      {
        "name": "Если светофор не работает, водители должны:",
        "buttons": [
          {
            "text": "1) Двигаться так, как будто для всех направлений горит жетый сигнал",
            "seccess": false
          },
          {
            "text": "2) Двигаться так, как будто для всех направлений горит зеленый сигнал",
            "seccess": false
          },
          {
            "text": "3) Остановиться, если это возможно",
            "seccess": false
          },
          {
            "text": "4) Двигаться так, как будто для всех направлений установлен знак \"STOP\"",
            "seccess": true
          }
        ]
      },
      {
        "name": "Белые знаки в форме вертикального прямоугольника означают:",
        "image": "https://russiantestdmv.com/wp-content/uploads/2020/08/Belye-pryamougolnye-vertikalnye-znaki-650x200.jpg",
        "buttons": [
          {
            "text": "1) Что впереди школьная зона",
            "seccess": false
          },
          {
            "text": "2) Вы должны следовать правилам, указанным на знаке",
            "seccess": true
          },
          {
            "text": "3) Расположение и расстояние до населенных пунктов",
            "seccess": false
          },
          {
            "text": "4) Потенциальные опасности на дороге",
            "seccess": false
          }
        ]
      },
      {
        "name": "Какие цвета у навигационных знаков?",
        "buttons": [
          {
            "text": "1) Желтый фон с черными символами и буквами",
            "seccess": false
          },
          {
            "text": "2) Зеленый фон с белыми символами и буквами",
            "seccess": true
          },
          {
            "text": "3) Белый фон с черными символами и буквами",
            "seccess": false
          },
          {
            "text": "4) Белый фон с красными символами и буквами",
            "seccess": false
          }
        ]
      },
      {
        "name": "Правило преимущества проезда нужно для:",
        "buttons": [
          {
            "text": "1) Постепенного отказа от светофоров на дорогах",
            "seccess": false
          },
          {
            "text": "2) Уменьшения числа аварий со школьными автобусами",
            "seccess": false
          },
          {
            "text": "3) Усложнения правил дорожного движения",
            "seccess": false
          },
          {
            "text": "4) Безопасного и равномерного движения транспорта на дорогах",
            "seccess": true
          }
        ]
      },
      {
        "name": "На нерегулируемом перекрестке водитель собирается повернуть, а пешеход перейти дорогу. Кто должен уступить?",
        "buttons": [
          {
            "text": "1) Водитель",
            "seccess": true
          },
          {
            "text": "2) Пешеход",
            "seccess": false
          },
          {
            "text": "3) Тот, кто медленнее движется",
            "seccess": false
          },
          {
            "text": "4) Тот, кто первым достиг перекрестка",
            "seccess": false
          }
        ]
      },
      {
        "name": "Какие цвета у знака \"STOP\"?",
        "buttons": [
          {
            "text": "1) Белый текст на красном фоне",
            "seccess": true
          },
          {
            "text": "2) Черный текст на желтом фоне",
            "seccess": false
          },
          {
            "text": "3) Красный текст на белом фоне",
            "seccess": false
          },
          {
            "text": "4) Белый текст на зеленом фоне",
            "seccess": false
          }
        ]
      },
      {
        "name": "Автомобили, въезжающие на скоростную трассу:",
        "buttons": [
          {
            "text": "1) Имеют преимущество проезда перед грузовиками",
            "seccess": false
          },
          {
            "text": "2) Должны уступить транспорту, движущемуся по шоссе",
            "seccess": true
          },
          {
            "text": "3) Имеют право проезда",
            "seccess": false
          },
          {
            "text": "4) Должны сразу перестроиться в левую полосу",
            "seccess": false
          }
        ]
      },
      {
        "name": "Какое из утверждений о круговом перекрестке является неверным?",
        "buttons": [
          {
            "text": "1) Включите правый поворотник, чтобы обозначить свое намерение выехать",
            "seccess": false
          },
          {
            "text": "2) Заезжайте на кольцевой перекресток с левой стороны и двигайтесь по часовой стрелке",
            "seccess": true
          },
          {
            "text": "3) Уступите дорогу автомобилям и велосипедистам, едущим по кругу",
            "seccess": false
          },
          {
            "text": "4) Не пытайтесь обогнать велосипедистов на круговой развязке",
            "seccess": false
          }
        ]
      },
      {
        "name": "Какую из указанных форм имеет знак STOP?",
        "image": "https://russiantestdmv.com/wp-content/uploads/2020/08/Formy-dorozhnyh-znakov-SShA-1-650x200.jpg",
        "buttons": [
          {
            "text": "1) № 1",
            "seccess": false
          },
          {
            "text": "2) № 2",
            "seccess": false
          },
          {
            "text": "3) № 3",
            "seccess": true
          },
          {
            "text": "4) № 4",
            "seccess": false
          }
        ]
      },
      {
        "name": "Что должен сделать водитель, увидев знак \"Wrong Way\"?",
        "image": "https://russiantestdmv.com/wp-content/uploads/2021/03/dorojnie-znaki-ssha-095-650x200.jpg",
        "buttons": [
          {
            "text": "1) Немедленно развернуться",
            "seccess": true
          },
          {
            "text": "2) Двигаться дальше с осторожностью",
            "seccess": false
          },
          {
            "text": "3) То же, что перед знаком \"СТОП\"",
            "seccess": false
          },
          {
            "text": "4) Остановиться и вызвать полицию",
            "seccess": false
          }
        ]
      },
      {
        "name": "Поворачивая направо, нужно:",
        "buttons": [
          {
            "text": "1) Начать перестраиваться после пересечения центра перекрестка",
            "seccess": false
          },
          {
            "text": "2) Начинать маневр из правой полосы",
            "seccess": true
          },
          {
            "text": "3) Начинать маневр из левой полосы",
            "seccess": false
          },
          {
            "text": "4) Начинать маневр с центральной полосы движения",
            "seccess": false
          }
        ]
      },
      {
        "name": "Что из перечисленного является правилом безопасного вождения?",
        "buttons": [
          {
            "text": "1) Всегда смотрите прямо на дорогу перед собой",
            "seccess": false
          },
          {
            "text": "2) Осматривайтесь по сторонам, чтобы быть в курсе дорожной ситуации",
            "seccess": true
          },
          {
            "text": "3) Уверенность в своих силах поможет избежать любых опасностей",
            "seccess": false
          },
          {
            "text": "4) Другие водители должны подстраиваться под ваши оплошности",
            "seccess": false
          }
        ]
      },
      {
        "name": "Для предотвращения заносов на скользкой дороге нужно:",
        "buttons": [
          {
            "text": "1) Замедляться перед входом в поворот",
            "seccess": false
          },
          {
            "text": "2) Тормозить заранее и с осторожностью",
            "seccess": false
          },
          {
            "text": "3) Уменьшить давление на педаль тормоза, если колеса начнут блокироваться",
            "seccess": false
          },
          {
            "text": "4) Все перечисленное",
            "seccess": true
          }
        ]
      },
      {
        "name": "Какая из указанных форм относится к знаку \"Yield\"?",
        "image": "https://russiantestdmv.com/wp-content/uploads/2020/08/Formy-dorozhnyh-znakov-SShA-1-650x200.jpg",
        "buttons": [
          {
            "text": "1) № 1",
            "seccess": false
          },
          {
            "text": "2) № 2",
            "seccess": true
          },
          {
            "text": "3) № 3",
            "seccess": false
          },
          {
            "text": "4) № 4",
            "seccess": false
          }
        ]
      },
      {
        "name": "Что следует сделать перед знаком \"Yield\"?",
        "image": "https://russiantestdmv.com/wp-content/uploads/2021/03/dorojnie-znaki-ssha-096-650x200.jpg",
        "buttons": [
          {
            "text": "1) Сбавить скорость и приготовиться остановиться, если потребуется",
            "seccess": true
          },
          {
            "text": "2) Уступить автомобилям экстренных служб",
            "seccess": false
          },
          {
            "text": "3) Полностью остановиться",
            "seccess": false
          },
          {
            "text": "4) Продолжать движение, следя за обстановкой по обеим сторонам",
            "seccess": false
          }
        ]
      },
      {
        "name": "Этот знак означает:",
        "image": "https://russiantestdmv.com/wp-content/uploads/2021/03/dorojnie-znaki-ssha-053-650x200.jpg",
        "buttons": [
          {
            "text": "1) Водителям запрещено поворачивать направо, если они едут со скоростью 25 миль/ч и меньше",
            "seccess": false
          },
          {
            "text": "2) За поворотом школьная зона",
            "seccess": false
          },
          {
            "text": "3) Не снижайте скорость на повороте ниже 25 миль/ч",
            "seccess": false
          },
          {
            "text": "4) Рекомендуемая скорость для входа в поворот не более 25 миль/ч",
            "seccess": true
          }
        ]
      },
      {
        "name": "Что имеет большее преимущество?",
        "buttons": [
          {
            "text": "1) Знак \"STOP\"",
            "seccess": false
          },
          {
            "text": "2) Непрерывно горящий красный сигнал светофора",
            "seccess": false
          },
          {
            "text": "3) Мигающий красный сигнал",
            "seccess": false
          },
          {
            "text": "4) Указания регулировщика",
            "seccess": true
          }
        ]
      }
    ]
  }
]